{
	"PROJECT_MENU": "Project Menu title",
	"NEW": "Menu title to create a new project",
	"SAVE_BLOCKS_LOCAL": "Menu title to save xml block file to the local machine",
	"LOAD_BLOCKS_LOCAL": "Menu title to load xml blocks from the local machine and put them in a new project",
	"IMPORT_BLOCKS_LOCAL": "Menu title to import xml blocks into the current project (keeping any current blocks)",
	"IMPORT_STL_MENU": "Menu title to import an .stl file from the local machine into the current project",
	"SAVE_SCAD_LOCAL": "Menu title to export Openscad code (.scad file) to the local machine",
	"OPTIONS_MENU": "Options Menu Title",
	"SIMPLE_TOOLBOX": "Menu option Simple Toolbox, a toolbox with only the most-used blocks",
	"ADVANCED_TOOLBOX": "Menu option Advanced Toolbox, a toolbox with all blocks available (this is the default)",
	"BLOCK_COLORS": "Menu option Block Color Scheme, allowing the user to switch the colors of the block categories",
	"CLASSIC_COLORS": "Menu option for original color scheme for blocks - the 'classic' or default option",
	"PALE_COLORS": "Menu option for pale color scheme for blocks",
	"HELP_MENU": "Help Menu Title",
	"DOCUMENTATION": "Menu link to tool documentation",
	"ABOUT": "Menu title for About page",
	"EXAMPLES_MENU": "Examples Menu Title",
	"PROJECT_NAME": "Project Name input area - text to indicate where the user can give a name to their project",
	"PROJECT_NAME_DEFAULT": "Project name default value - the name given to every new project to indicate that it doesn't have a title yet",
	"BLOCKS_TAB": "Blocks Tab text - tab text for switching to the view of the block form of the program",
	"CODE_TAB": "Code Tab text - tab text for switching to the text view of the program code",
	"RENDER_BUTTON": "Render button text",
	"ABORT_BUTTON": "Abort button text - button used to cancel rendering",
	"GENERATE_STL": "Generate STL button text",
	"RENDERING": "Rendering in progress informational text",
	"SPHERE": "Sphere Block - block that produces a sphere",
	"RADIUS": "Radius - the distance from the center of a circle or sphere to its edge",
	"CENTERED": "Centered - property of a shape which makes it centered at the origin (where X, Y, Z axes intersect)",
	"NOT_CENTERED": "Not Centered - property of a shape which is not centered along one or more axes",
	"CUBE": "Cube block - block that produces a cube",
	"CYLINDER": "Cylinder block - block that produces a cylinder or cone",
	"TORUS": "Torus block - block that produces a torus",
	"CIRCLE": "Circle block - block that produces a 2D circle",
	"SQUARE": "Square block - block that produces a 2D square",
	"TRANSLATE": "Translate - move a shape around in space",
	"ROTATE": "Rotate - rotate a shape in space",
	"MIRROR": "Mirror - mirror or reflect a shape across a plane",
	"SCALE": "Scale - scale the size of a shape up or down",
	"COLOR": "Color - change the color of a shape",
	"SIDES": "Sides - change the smoothness, or resolution, of a shape by changing how many sides are used to approximate a curve",
	"TAPER": "Taper - taper a shape along an axis",
	"LINEAR_EXTRUDE": "Linear Extrude - extrude a 2D shape upwards to form a 3D shape",
	"ROTATE_EXTRUDE": "Rotate Extrude - extrue a 2D shape around in a ring to form a torus",
	"HEIGHT": "Height - a parameter of a shape to control how high or tall it is",
	"FACES": "Faces - a torus parameter to control how many segments are used to approximate the curve of the cross-section",
	"ACROSS": "Across - for mirroring a shape 'across' a plane",
	"ALONG": "Along - for tapering a shape 'along' an axis",
	"AXIS": "Axis - line of rotation in 3D space",
	"ROTATE_ADVANCED": "Advanced rotation: applies a rotation around a vector specified by the user.  Needs to differentiate the block from the basic rotation block.",
	"MIRROR_ADVANCED": "Advanced mirror: applies a reflection across a plane whose normal vector is specified by the user.  Needs to differentiate the block from the basic mirror block.",
	"AROUND": "Around: for rotation 'around' a specified axis",
	"RGB_COLOR_MODEL": "RGB - a color model with the parameters red, green, blue",
	"HSV_COLOR_MODEL": "HSV - a color model with the parameters hue, saturation, and value.",
	"COLOR_HUE": "Hue: the first parameter in the HSV (hue, saturation, value) color scheme",
	"COLOR_SATURATION": "Saturation: the second parameter in the HSV (hue, saturation, value) color scheme",
	"COLOR_VALUE": "Value: the third parameter in the HSV (hue, saturation, value) color scheme",
	"TWIST": "Twist: as a shape is rotated upward, it can be gradually 'twist'ed (turned, rotated) ending up with a partial corkscrew or helix type of shape.",
	"IMPORT_STL": "STL Import: this is a block that, when clicked, allows the user to upload an STL file (a 3D shape) from their local computer into their project.",
	"BROWSE": "Browse: button that, when pressed, allows the user to pick out the file they want to upload from all the choices in a directory.",
	"TEXT": "Text: general term for letters, numbers, and other symbols available on a keyboard",
	"FONT_SIZE": "Font size: word to indicate how large or small the letters should be printed",
	"FONT_NAME": "Font: the style that the letters are written in",
	"TEXT_THICKNESS": "Thickness: when letters are printed on the XY plane, 'thickness' is how high the letter model is in the Z direction.",
	"TEXT_DEFAULT_VALUE": "Default Text:  the default text in a text block.  A conversational greeting word is a good choice.  In English this is 'hello'.",
	"CONVEX_HULL": "Convex Hull: this block computes the convex hull of the set of points of all the shapes given to it.  The effect is to wrap the objects together into a single convex object (with no parts that dip inward). This is a mathematical term.",
	"DIFFERENCE": "Difference: takes one object and subtracts away another. This is a term from set theory in mathematics.",
	"UNION": "Union: groups objects into a single object.  This is a term from set theory in mathematics.",
	"INTERSECTION": "Intersection: returns the overlapping parts of two or more objects.  This is a term from set theory in mathematics.",
	"PLUS": "Plus: a word used when adding numbers together:  A 'plus' B  is A + B",
	"MINUS": "Minus: the word used when subtracting numbers:  A 'minus' B  is  A - B",
	"WITH": "With: preposition to indicate that two things are together:  combine A 'with' B",
	"CATEGORY_3D_SHAPES": "3D Shapes:  these blocks model three dimensional shapes like spheres, cubes, and cylinders",
	"CATEGORY_2D_SHAPES": "2D Shapes:  these blocks model flat shapes like circles and spheres",
	"CATEGORY_TRANSFORMS": "Transforms: These blocks apply mathematical transformations to their child shapes, such as moving them, rotating them, scaling them, etc.",
	"CATEGORY_SET_OPERATIONS": "Set Operations: These blocks combine multiple child shapes with mathematical set theory operations like union, difference, and intersection.",
	"CATEGORY_MATH": "Math: these blocks are used to make mathematical calculations",
	"CATEGORY_LOGIC": "Logic: these blocks perform logical operations that return true/false values like (if A > B),  or (if C is true then do something), or (does A equal B?)",
	"CATEGORY_LOOPS": "Loops: loops are a programming concept that allow actions to be repeated a number of times (specified by the programmer)",
	"CATEGORY_TEXT": "Text: these blocks allow the modeling of text as a 3D or 2D mesh",
	"CATEGORY_VARIBLES": "Variables: variables are used to store data in memory (in computer programming).",
	"CATEGORY_PROCEDURES": "Procedures: Blocks for defining [https://en.wikipedia.org/wiki/Procedure_(computer_science) functions].  OpenSCAD refers to their functions/procedures as 'modules', so that is the choice in English."
}
